{"recipes":
[{"id":"1", 
"title":"Spaghetti Bolognese",
"description":"This ultimate pasta recipe is a total classic, delicious, and super-easy to knock together.",
"image":"https://img.jamieoliver.com/jamieoliver/recipe-database/80307052.jpg?tr=w-800,h-1066",
"cooktime": "1 HOUR 15 MINUTES",
"servings": "6",
"directions": 
["Preheat the oven to 180ºC/350ºF/gas 4.", 
"Peel and finely chop the garlic and onions, pick and finely chop the rosemary, then finely slice the bacon.", 
"Heat a splash of oil in a casserole pan on a medium heat, add the bacon, rosemary, garlic and onion and cook for 5 minutes, or until softened, stirring occasionally.", 
"Add the minced beef, breaking it apart with the back of a spoon, then cook for 2 to 3 minutes, or until starting to brown, then pour in the wine. Leave to bubble and cook away.", 
"Meanwhile, drain and tip the sun-dried tomatoes into a food processor, blitz to a paste, then add to the pan with the tomatoes. Stir well, break the plum tomatoes apart a little.", 
"Cover with a lid then place in the oven for 1 hour, removing the lid and giving it a stir after 30 minutes. If it looks a little dry at this stage, add a splash of water to help it along.", 
"About 10 minutes before the time is up, cook the spaghetti in boiling salted water according to the packet instructions.",
"Once the spaghetti is cooked, drain, reserving a mugful of cooking water, then return to the pan with a few spoons of Bolognese, a good grating of Parmesan and a drizzle of extra virgin olive oil.", 
"Toss to coat the spaghetti, loosening with a splash of cooking water, if needed.",
"Divide the spaghetti between plates or bowls, add a good spoonful of Bolognese to each, then serve with a fine grating of Parmesan."],
"ingredients": [{"type": "Garlic", "measure": "2 cloves of"}, {"type": "Onion", "measure": "1"}, {"type": "Rosemary", "measure": "2 sprigs of fresh"}, {"type": "streaky bacon", "measure": "6 dry-cured higher-welfare smoked"},
{"type": "Olive Oil", "measure":"three table spoons"}, {"type": "minced beef", "measure":"500 g"}, {"type": "red wine", "measure":"200 ml "}, {"type": "sun-dried tomatoes", "measure":"1 x 280 g jar of "}, {"type": "plum tomatoes", "measure":"2 x 400 g tins of "}, 
{"type": "dried spaghetti", "measure":"500 g "}, {"type": "Parmesan cheese", "measure":""}, {"type": "extra virgin olive oil", "measure":""}],
"comments": [{"name": "John", "text": "Really Enjoyed", "rating": "4.5"}, {"name": "Jane", "text": "Very Good", "rating": "4.3"}, {"name": "Marko", "text": "very taste", "rating": "4.4"} ]},
[{"id":"2", 
"title":"Chicken & Merguez stew",
"description":"This is a really delicious Tunisian-style casserole, using the French cassoulet as inspiration to create massive flavour with hardly any ingredients. Feel free to add a little harissa into the mix, if you like.",
"image":"https://img.jamieoliver.com/jamieoliver/recipe-database/147630496.jpg?tr=w-800,h-1066",
"cooktime": "1 HOUR",
"servings": "4",
"directions": ["Peel, halve and roughly slice the onions, then place in a large casserole pan on a medium heat with 1 tablespoon of olive oil. Squeeze the meat from 1 of the sausages into the pan and fry for 20 minutes, stirring regularly and breaking up the sausage.", 
"Meanwhile, carefully cut up the chicken (you'll need to split the legs into thighs and drumsticks and remove the wings), and cut the breast into quarters (on the bone) have a go at this yourself, or ask your butcher to do it for you.", 
"Remove the stalks from 8 of the bay leaves, bash the leaves to a mush with a pinch of sea salt in a pestle and mortar, then muddle in 1 tablespoon each of extra virgin olive oil and red wine vinegar. Rub half of the marinade all over the chicken, getting into all the nooks and crannies.", 
"Put a large non-stick frying pan on a medium-high heat with 1 tablespoon of olive oil, and brown the remaining sausages with the thighs, drumsticks and wings, transferring them to the casserole pan when beautifully golden.", 
"Brown the breast skin side down for 3 minutes, then transfer to the casserole pan. Meanwhile, drain one of the tins of beans, then tip both tins into the casserole pan with the rest of the bay leaves. ", 
"Gently mix together, then turn the heat down to medium-low and cook for 30 minutes with the lid on, or until beautifully tender. Drizzle over the rest of the bay marinade, to serve."],
"ingredients": [{"type": "onion", "measure": "4"}, {"type": "Merguez sausages", "measure": "5 or 300g"}, {"type": "chicken", "measure": "1 x 1.2kg whole free-range"}, {"type": "bay leaves", "measure": "12 fresh"}, {"type": "mixed beans", "measure": "2 x 400g tins of"}],
"comments": [{"name": "Aziz", "text": "molto Buono", "rating": "4.1"}, {"name": "Brian", "text": "Bloody Good", "rating": "4.25"}, {"name": "Mary", "text": "I realy enjoyed this meal", "rating": "4.5"} ] },
[{"id":"3", 
"title":"Lemon-tzatziki chicken",
"description":"A brilliant Greek-inspired one-pan family dish. Tzatziki makes a fantastic ready-to-go marinade – it’s untraditional used like this, but I can totally vouch for its deliciousness and ability to tenderize meat.",
"image":"https://img.jamieoliver.com/jamieoliver/recipe-database/150955945.jpg?tr=w-800,h-1066",
"cooktime": "2 HOURS PLUS MARINATING",
"servings": "4",
"directions": ["Use a sharp knife to carefully cut down the back of the chicken, so you can open it out flat. Rub half the tzatziki all over the chicken with the juice of ½ a lemon and good pinch of sea salt and black pepper, then cover and leave to marinate in the fridge for at least 2 hours, preferably overnight. ", 
" Preheat the oven to 180°C/350°F/gas 4. Peel the onions, then very finely chop half an onion and place in a bowl with the juice of ½ a lemon and a pinch of salt to make a pickle.", 
"Quarter the rest of the onions and place in a deep tray or ovenproof pan, then halve and add the remaining lemon. Place the chicken skin side up on top (it should fit snugly) and drizzle with ½ a tablespoon of olive oil.", 
"Roast for 1 hour 10 minutes, or until beautifully golden and the leg meat pulls easily away from the bone. When the time’s up, remove the chicken with half the roasted onions and one jammy lemon half to a board for later.", 
"Using tongs, carefully squeeze the other jammy lemon half into the pan of tray juices, then cut off and discard the white pith and finely slice the skin, along with the rest of the onions. Put them back into the pan or tray along with the rice and 600ml of boiling salted water, then cover and cook on the hob on a medium-low heat for 12 minutes, or until tender.", 
"Spoon the rice into a serving dish, place the chicken, any resting juices and the reserved roasted onions on top, and spoon over the remaining tzatziki. Drizzle with 1 tablespoon of extra virgin olive oil and serve with the pickle and the reserved cooked lemon half, for squeezing over."],
"ingredients": [{"type": "chicken", "measure": "1 x 1.5kg whole free-range"}, {"type": "tzatziki", "measure": "2 x 200g tubs of"}, {"type": "lemons", "measure": "2"}, {"type": "onions", "measure": "4 mixed-colour "}, {"type": "basmati rice", "measure": "300 g"}],
"comments": [{"name": "Michael", "text": "ummm", "rating": "3.7"}, {"name": "Ian", "text": "uhhh", "rating": "3.8"}, {"name": "Simon", "text": "ohhhh", "rating": "4.0"}
}],
[{"id":"4", 
"title":"Shakshuka",
"description":"Harissa adds warmth and a ray of much-needed sunshine to my twist on a Middle-Eastern classic. Plus it’s a one-pan wonder, which always makes me happy.",
"image":"https://img.jamieoliver.com/jamieoliver/recipe-database/100021003.jpg?tr=w-800,h-1066",
"cooktime": "30 minutes",
"servings": "4",
"directions": ["Scrub the potatoes and squash (deseed if needed), slice into 1cm-thick chips, then place in a large non-stick frying pan on a medium heat with 1 tablespoon of oil.", 
"Deseed and roughly chop the peppers, adding them to the pan as you go.", 
"Pick the parsley leaves, finely slicing the stalks. Peel and finely slice the garlic and add to the pan with the parsley stalks, fennel seeds, paprika and cumin, then cover and cook for 10 minutes, stirring regularly.", 
"Flick over the harissa and scrunch in the tomatoes, then stir in ¼ of a tin's worth of water, pop the lid back on and cook for a further 10 minutes, or until the potatoes and squash are soft, stirring occasionally.", 
"Remove the lid, stir in the parsley leaves and season with a pinch of sea salt, then cook until the sauce has thickened and reduced.", 
"Make 4 wells with the back of a spoon, crack in the eggs, pop the lid on and cook the eggs to your liking. Nice served with warm flatbreads and extra harissa, if you like."],
"ingredients": [{"type": "potatoes", "measure": "200 g"}, {"type": "butternut squash", "measure": "200 g"}, {"type": "olive oil", "measure": "3 table spoons"}, 
{"type": "peppers", "measure": "3 mixed-colour "}, {"type": "parsley", "measure": "½ a bunch of fresh flat-leaf (15 g)"}, {"type": "2 cloves of", "measure": "garlic"}, {"type": "", "measure": ""}, 
{"type": "smoked paprika", "measure": "1 teaspoon"}, {"type": "ground cumin", "measure": "1 teaspoon"}, {"type": "fennel seeds", "measure": "1 teaspoon"}, {"type": "rose harissa", "measure": "1 teaspoon"},
{"type": "plum tomatoes", "measure": "1 x 400 g tin of quality"}, {"type": "4 large ", "measure": "eggs"}],
"comments": [{"name": "Michael", "text": "ummm", "rating": "3.7"}, {"name": "Ian", "text": "uhhh", "rating": "3.8"}, {"name": "Simon", "text": "ohhhh", "rating": "4.0"}]
}],
[{"id":"5", 
"title":"Herby steak & crispy potatoes",
"description":"Inspired by pistou, a beautiful French condiment made with smashed basil, garlic and oil, this tasty dish is a joy to eat. I’ve swapped in pesto for ease, but buy fresh for amplified flavour and texture.",
"image":"https://img.jamieoliver.com/jamieoliver/recipe-database/152012100.jpg?tr=w-800,h-1066",
"cooktime": "30 minutes",
"servings": "2",
"directions": ["Scrub the potatoes, chop into 2cm chunks, then place in a large non-stick frying pan on a medium heat with 2 tablespoons of olive oil and season with sea salt and black pepper. Fry for 20 minutes, or until golden and cooked through, stirring regularly, then remove to a bowl. Put the pan back on a high heat.", 
"Cut the fat off the steak, then roughly chop the fat and place in the pan to render. Generously season the steak, rub all over with 2 teaspoons of pesto, and cook for 3 minutes on each side for medium rare, or to your liking. Remove to a plate to rest.", 
"Return the potatoes to the pan to warm through, while you slice the tomatoes 1cm thick and arrange on serving plates. ", 
"Dress with a splash of red wine vinegar and a drizzle of extra virgin olive oil, and season to perfection. ", 
"Spoon over the potatoes, then slice and divide up the steak, pouring over any resting juices. ", 
"Spoon over the remaining pesto, then bash and scatter over the pistachios. Finish with a drizzle of extra virgin olive oil, if you like."],
"ingredients": [{"type": "potatoes", "measure": "500 g red-skinned "}, {"type": "sirloin steak", "measure": "1 x 300g higher-welfare"}, {"type": "green pesto , or pistou", "measure": "4 teaspoons fresh "}, 
{"type": "tomatoes", "measure": "6 ripe medium mixed-colour "}, {"type": "pistachios", "measure": "20 g shelled unsalted"}],
"comments": [{"name": "John", "text": "Really Enjoyed", "rating": "4.5"}, {"name": "Jane", "text": "Very Good", "rating": "4.3"}, {"name": "Marko", "text": "very taste", "rating": "4.4"}]
}]
}